[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:46:42
                     id="name"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("name", {
-                        required: "name is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
