[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:39:21
         },
 
         {
-            Header: 'orgTranslationShort',
+            Header: "",
             accessor: 'orgTranslationShort',
         },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: orgTranslationShort. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
