[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:60:72
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: "Required: Requester Email"})}
+                            {...register("requesterEmail", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Required: Requester Email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:78:42
                             id="teamId"
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
-                            {...register("teamId", { required: "Required: Team Id"})}
+                            {...register("", { required: "Required: Team Id"})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:78:64
                             id="teamId"
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
-                            {...register("teamId", { required: "Required: Team Id"})}
+                            {...register("teamId", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Required: Team Id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:119:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Required: Request Time.'}
+                            {false}
                             {errors.requestTime?.type === 'pattern' && 'Note: Request Time must be in iso format'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Required: Request Time./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:119:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Required: Request Time.'}
+                            {errors.requestTime || 'Required: Request Time.'}
                             {errors.requestTime?.type === 'pattern' && 'Note: Request Time must be in iso format'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on bad input: requestTime
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:120:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requestTime && 'Required: Request Time.'}
-                            {errors.requestTime?.type === 'pattern' && 'Note: Request Time must be in iso format'}
+                            {errors.requestTime?.type === 'pattern' || 'Note: Request Time must be in iso format'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Note: Request Time must be in iso format</div> instead

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:120:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requestTime && 'Required: Request Time.'}
-                            {errors.requestTime?.type === 'pattern' && 'Note: Request Time must be in iso format'}
+                            {errors.requestTime.type === 'pattern' && 'Note: Request Time must be in iso format'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:157:43
                             type="text"
                             isInvalid={Boolean(errors.solved)}
                             {...register("solved", {
-                                required: true, pattern: /^(true|false)$/
+                                required: false, pattern: /^(true|false)$/
                             })}
                         />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Required: Solved./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:157:58
                             type="text"
                             isInvalid={Boolean(errors.solved)}
                             {...register("solved", {
-                                required: true, pattern: /^(true|false)$/
+                                required: true, pattern: /^(true|false)/
                             })}
                         />
killedBy: HelpRequestForm tests kill mutation for solved: truef
statusReason: Error: Unable to find an element with the text: /Note: Solved must be true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:161:26
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                        {errors.solved && 'Required: Solved.'}
+                        {false}
                         {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Required: Solved./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:161:26
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                        {errors.solved && 'Required: Solved.'}
+                        {errors.solved || 'Required: Solved.'}
                         {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on bad input: requestTime
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:162:26
                         />
                         <Form.Control.Feedback type="invalid">
                         {errors.solved && 'Required: Solved.'}
-                        {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
+                        {errors.solved?.type === 'pattern' || 'Note: Solved must be true or false'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Note: Solved must be true or false</div> instead

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:162:26
                         />
                         <Form.Control.Feedback type="invalid">
                         {errors.solved && 'Required: Solved.'}
-                        {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
+                        {errors.solved.type === 'pattern' && 'Note: Solved must be true or false'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
